Revit 2027 API
IFCHybridImport Constructor
 Constructs a new IFCHybridImport instance for importing IFC via Hybrid method.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCHybridImport()
Public Sub New
public:
IFCHybridImport()
new : unit -> IFCHybridImport
See Also
Reference
IFCHybridImport Class
Autodesk.Revit.DB.IFC Namespace